#include <iostream>

/***********************************    lambda 表达式    **********************************************
 * 1.lambda 表达式 （https://leanpub.com/cpplambda）
 *  - 为了更灵活地实现可调用对象而引入
 *  - c++11 ~ c++20 持续更新
 *      c++11 引入 lambda 表达式
 *      c++14 支持初始化捕获、泛型 lambda 
 *      c++17 引入constexptr  lambda *this 捕获
 *      c++20 引入concepts ， 模板 lambda 
 *  - lambda 表达式会被编译器翻译成类进行处理
 ********************************************************************************************************/


int main()
{

    return 0;
}